// 1. Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let a = +prompt(`Введiть першу змiнну «А»:`);
// let b = +prompt(`Введiть другу змiнну «В»:`);
// if (a > b) {
//     document.write(`Змiнна (A) ${a} > ${b} змiнноi (B)`);
// } else if (a < b) {
//     document.write(`Змiнна (A) ${a} < ${b} змiнноi (B)`);
// } else if (a === b) {
//     document.write(`Змiнна (A) ${a} = ${b} змiннiй (B)`);
// }


// 2. У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let appartment = +prompt(`Введiть номер квартири з 1-i по 90-у`);
// if (appartment > 0 && appartment <= 20) {
//     document.write(`Квартира N ${appartment} з 1-го пiд'iзду`);
// } else if (appartment >20 && appartment <= 48) {
//     document.write(`Квартира N ${appartment} з 2-го пiд'iзду`);
// } else if (appartment >48 && appartment <= 90) {
//     document.write(`Квартира N ${appartment} з 3-го пiд'iзду`);
// } else if (appartment >90 || appartment === 0) {
//     document.write(`Такоi квартири N ${appartment} не iснуэ !!!`);
// }

// 3. Ми маємо змінну number в яку користувач задає числове значення,
//    якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна
//    не рівна 10 - тоді НЕВІРНО

// let number = +prompt(`Введiть змінну "number"`);
// let result = number === 10 ? `ВІРНО` : `НЕВІРНО`;
// document.write(result);

// 4. Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну
// записане число, вивести 1, якщо в змінну записали стрінгу вивести 2,
// якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = true;
// if (typeof (x) === 'number') {
//     document.write(`1 - зміннa X = "  ${x} " - число`);
// } else if (typeof (x) === 'string') {
//     document.write(`2 - зміннa X = " ${x} " - стрінгa`);
// } else if (typeof (x) === 'boolean') {
//     document.write(`3 - зміннa X = " ${x} " - булеве значення`);
// } else if (typeof (x) === 'string') {
//     document.write(`3 - зміннa X = " ${x} " - об'єкт`);
// } else {
//     document.write(`Шость пiшло НЕ ТАК - GAME OVER`);
// }

// 5. Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести
//     повідомлення що ми йдемо ВЧИТИСЯ. Якщо інша темпаретура, тоді виводимо
//     повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperature = +prompt(`Яка сьогоднi ТЕМПЕРАТУРА?`);
// let quest = temperature > 9 && temperature <= 22 ? 'ми йдемо ВЧИТИСЯ' : `сидимо вдома і вчимося ОНЛАЙН`;
// document.write(quest);

// 6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число
//    від 1 до 5. І взалежності від введеного числа нам дається приз.
//    (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести
//    Повідомлення - що число не вірне ... .

// let number = +prompt(`Ви можете ввести число вiд 1 до 5 - БУДЬ ЛАСКА!`);
// switch (number) {
//     case 1 :
//         document.write(`Поздоровляэмо Вас - Ви виграли AВТIВКУ`);
//         break;
//     case 2 :
//         document.write(`Поздоровляэмо Вас - Ви виграли крутий БАЙК`);
//         break;
//     case 3 :
//         document.write(`Поздоровляэмо Вас - Ви виграли IPhone X`);
//         break;
//     case 4 :
//         document.write(`Поздоровляэмо Вас - Ви виграли ЛЬОДЯНИК`);
//         break;
//     case 5 :
//         document.write(`Поздоровляэмо Вас - Ви виграли БЕЗКОШТОВНО КУРС JS COMPLEX`);
//         break;
//     default :
//         document.write(`число не вірне ...`);
// }
